// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

Console.WriteLine("Ввведите число:");
int numN = int.Parse(Console.ReadLine ());
Console.ReadLine (numN%2 == 0)